---
title: DisciplineTypeId
classe: Autodesk.Revit.DB.DisciplineTypeId
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 8
---

# DisciplineTypeId

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ForgeTypeId Architecture { get; }` | `DisciplineTypeId.Architecture` | ForgeTypeId |
| `ForgeTypeId Common { get; }` | `DisciplineTypeId.Common` | ForgeTypeId |
| `ForgeTypeId Electrical { get; }` | `DisciplineTypeId.Electrical` | ForgeTypeId |
| `ForgeTypeId Energy { get; }` | `DisciplineTypeId.Energy` | ForgeTypeId |
| `ForgeTypeId Hvac { get; }` | `DisciplineTypeId.Hvac` | ForgeTypeId |
| `ForgeTypeId Infrastructure { get; }` | `DisciplineTypeId.Infrastructure` | ForgeTypeId |
| `ForgeTypeId Piping { get; }` | `DisciplineTypeId.Piping` | ForgeTypeId |
| `ForgeTypeId Structural { get; }` | `DisciplineTypeId.Structural` | ForgeTypeId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```